dessertrecipes.org
#+SETUPFILE: ./setup/dessertrecipes.setup
#+TITLE: Dessert Recipes (HOMEPAGE LINK: https://www.musimatic.xyz)
#+OPTIONS: num:nil
* README For "Dessert Recipes":
NOTE: These are recipes that I have gathered from the internet, and are mostly NOT my own.

I will indicate my own recipes with a "By: Samuel Banya" section in its title whenever 
necessary.

This being noted, I have the related links whenever possible to the original creators, so
feel free to visit those links to find out even more great food recipes.

I am including them here in one quick and accessible page for myself, but also for you to 
enjoy in plain-text format to be read on any device, courtesy of Emacs Org Mode :)
* Banana Bread Recipe
** Link:
- https://thesaltymarshmallow.com/one-bowl-chocolate-chip-banana-bread/
** Ingredients:
- 3 Ripe Bananas
- 1/2 Cup Butter, Melted
- 1/2 Cup Sour Cream
- 2 Large Eggs
- 1 Cup Granulated Suar
- 1 Teaspoons Vanilla Extract
- 1 Teaspoon Baking Soda
- 1 Teaspoon Salt
- 1 1/2 Cups All Purpose Flour
- 1/2 Cup Chocolate Chips
** Directions
1. Preheat oven to 350F degrees.

2. Grease a 9x5 inch loaf pan with vegetable oil, or spray with non stick cooking spray that has flour added.

3. In a large bowl mash the bananas until smooth.

4. Stir in the melted butter and sour cream.

5. Stir in the eggs, sugar, and vanilla extract.
    
6 . Stir in the baking soda, salt, and flour until just combined.

7. Fold in the chocolate chips.
    
8. Pour batter into the prepared pan.

9. Bake for 50-60 minutes, until a toothpick inserted in the center comes out clean.
* Cherry Pie Recipe
** Link:
- https://www.seriouseats.com/recipes/2016/06/fresh-cherry-pie-filling-recipe.html
** Ingredients:
*** Filling:
- 28 ounces pitted cherries (5 heaping cups; 790g), from about 2 pounds whole fruit (6 heaping cups; 910g) (see note)
- 1 ounce fresh lemon juice (2 tablespoons; 30g) from 1 small lemon
- 7 ounces sugar (1 cup; 195g)
- 3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight
- 1 1/2 ounces tapioca starch, such as Bob's Red Mill (1/3 cup plus 1 teaspoon; 40g)
*** Crust
- Old-Fashioned Flaky Pie Dough, rolled and chilled as per the directions for a double crust
*** For the Egg Wash (optional):
- 1 large egg
- 1 large egg yolk
- 1/2 ounce heavy cream (1 tablespoon; 15g)
- 1/8 teaspoon (1/2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight
