dessertrecipes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-30 Sat 22:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dessert Recipes (HOMEPAGE LINK: https://www.musimatic.xyz)</title>
<meta name="author" content="Samuel Banya" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/dessertrecipes.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Dessert Recipes (HOMEPAGE LINK: <a href="https://www.musimatic.xyz">https://www.musimatic.xyz</a>)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb42541e">README For "Dessert Recipes":</a></li>
<li><a href="#orge6c0043">Banana Bread Recipe</a>
<ul>
<li><a href="#orgcb7b538">Link:</a></li>
<li><a href="#org4475fc2">Ingredients:</a></li>
<li><a href="#org58942f4">Directions</a></li>
</ul>
</li>
<li><a href="#org8f365f1">Cherry Pie Recipe</a>
<ul>
<li><a href="#org8ddab93">Link:</a></li>
<li><a href="#org3b9a284">Ingredients:</a>
<ul>
<li><a href="#orgb57dd8a">Filling:</a></li>
<li><a href="#org6b8f89d">Crust</a></li>
<li><a href="#org535c024">For the Egg Wash (optional):</a></li>
</ul>
</li>
<li><a href="#orgdb6e86f">Directions:</a></li>
</ul>
</li>
<li><a href="#org03a5af5">Chocolate Babka Recipe</a>
<ul>
<li><a href="#org7f567bb">Link:</a></li>
<li><a href="#orgf1353f8">Ingredients:</a>
<ul>
<li><a href="#orgaca78ec">Dough Ingredients:</a></li>
<li><a href="#org3f6015a">Chocolate Filling Ingredients:</a></li>
<li><a href="#org2110c44">Sugar Syrup Ingredients:</a></li>
</ul>
</li>
<li><a href="#orgf253c24">Directions:</a></li>
</ul>
</li>
<li><a href="#org0b75c3f">Coconut Custard Pie Recipe</a>
<ul>
<li><a href="#org57ebb4b">Links:</a></li>
<li><a href="#org80cfb52">Ingredients:</a></li>
<li><a href="#orgd506b4f">Directions:</a></li>
</ul>
</li>
<li><a href="#org4e21dc8">Diós Tészta (Hungarian Sweet Walnut Pasta) Recipe</a>
<ul>
<li><a href="#org94403f5">Link</a></li>
<li><a href="#orgd356a4a">Ingredients: (Serves 4 people)</a></li>
<li><a href="#org229ce1a">Directions:</a></li>
</ul>
</li>
<li><a href="#org015636c">Hideg Meggyleves Recipe (Cold Cherry Soup)</a>
<ul>
<li><a href="#orgf4edb54">Links:</a></li>
<li><a href="#orgbf1384b">Ingredients:</a></li>
<li><a href="#orgf139506">Directions:</a></li>
</ul>
</li>
<li><a href="#org2a0f92f">Hungarian Gerbeaud Cake (Zserbó Szelet)</a>
<ul>
<li><a href="#org6d3ce5e">Link:</a></li>
<li><a href="#org98c2387">Ingredients:</a></li>
<li><a href="#orgfd498aa">Directions:</a></li>
</ul>
</li>
<li><a href="#org0c3b49c">Ice Cream In A Blender Recipe</a>
<ul>
<li><a href="#orgd378e98">Link:</a></li>
<li><a href="#org80f3986">Ingredients:</a></li>
<li><a href="#org9d8ccc0">Directions:</a></li>
</ul>
</li>
<li><a href="#orge681818">Idea For Animal Cracker Ice Cream</a>
<ul>
<li><a href="#orgc47e3b1">Idea:</a></li>
</ul>
</li>
<li><a href="#orgba619dd">Idea To Make Soft Serve Ice Cream</a>
<ul>
<li><a href="#org7425ba6">Link:</a></li>
</ul>
</li>
<li><a href="#orge67630d">Instant Pot Old-Fashioned Rice Pudding</a>
<ul>
<li><a href="#org27953fe">Link:</a></li>
<li><a href="#org0e44ffd">Ingredients:</a></li>
<li><a href="#org7d22907">Directions:</a></li>
</ul>
</li>
<li><a href="#orgea55034">Kifli Recipe (Hungarian Crescent Rolls)</a>
<ul>
<li><a href="#org469dae4">Links:</a></li>
<li><a href="#org63a90a6">Ingredients:</a></li>
<li><a href="#org4bc9ef3">Directions:</a></li>
</ul>
</li>
<li><a href="#orgf0e66a1">Krémes Recipe</a>
<ul>
<li><a href="#org70dd9aa">Link:</a></li>
<li><a href="#org39abb82">Ingredients:</a>
<ul>
<li><a href="#org2d554e9">For Vanilla-Infused Milk:</a></li>
<li><a href="#orge00bd32">For Flaky Pastry:</a></li>
<li><a href="#org916d7c8">For Custard:</a></li>
<li><a href="#orge7d807a">For Dusting:</a></li>
</ul>
</li>
<li><a href="#orgba555c1">Directions (Makes 12 Servings):</a></li>
</ul>
</li>
<li><a href="#org64250e0">Mákos Nudli Recipe</a>
<ul>
<li><a href="#orgcdb402f">Recipe Link</a></li>
<li><a href="#orgf031c39">Ingredients:</a></li>
<li><a href="#org4d9849b">Directions:</a></li>
</ul>
</li>
<li><a href="#orgc851ff6">Mákos Tészta Recipe</a>
<ul>
<li><a href="#orga4baca0">Link</a></li>
<li><a href="#orgdd4b966">Ingredients: (Serves 4 People)</a></li>
<li><a href="#orgd96c89c">Directions:</a></li>
</ul>
</li>
<li><a href="#orgb6a7900">Magyar Szilvásgombóc Recipe (Hungarian Plum Dumplings)</a>
<ul>
<li><a href="#org632b105">Ingredients:</a></li>
<li><a href="#org609bd23">Directions:</a></li>
</ul>
</li>
<li><a href="#org23a0a89">Millionaire Short Bread Cookie Recipe</a>
<ul>
<li><a href="#org67e8c48">Link</a></li>
</ul>
</li>
<li><a href="#org63eeaf3">Palascinta Recipe (Food Network)</a>
<ul>
<li><a href="#org59d67bb">Link</a></li>
<li><a href="#orgc64348e">Palascinta Ingredients:</a></li>
<li><a href="#org108b25d">Directions:</a></li>
</ul>
</li>
<li><a href="#orgedf4252">Palascinta Recipe (By: Samuel Banya)</a>
<ul>
<li><a href="#org7039e75">Palascinta Ingredients:</a></li>
<li><a href="#orgd77788a">Turos Filling Ingredients:</a></li>
<li><a href="#orgfef4f80">Directions:</a></li>
</ul>
</li>
<li><a href="#orgd0c1c64">Rizskoch Recipe (Hungarian Rice Pudding Cake)</a>
<ul>
<li><a href="#orgfd1376b">Link:</a></li>
<li><a href="#orgd776dd8">Ingredients (Makes 6 to 8 portions)</a></li>
<li><a href="#orgbbf74a7">Directions:</a></li>
</ul>
</li>
<li><a href="#org7a01251">Sour Cherry Blondies</a>
<ul>
<li><a href="#orgfb7b242">Link:</a></li>
<li><a href="#orgebbe5dd">Ingredients:</a></li>
<li><a href="#org1f57add">Directions:</a></li>
</ul>
</li>
<li><a href="#orgc67f62d">Strawberry Ice Cream In A Blender Recipe</a>
<ul>
<li><a href="#org112da85">Link:</a></li>
<li><a href="#orge8bf4b7">Ingredients:</a></li>
<li><a href="#org5628b3a">Directions:</a></li>
</ul>
</li>
<li><a href="#org4c54548">Turos Ice Cream Recipe (By: Samuel Banya)</a>
<ul>
<li><a href="#org5140e64">Ingredients:</a></li>
<li><a href="#org9a08a30">Directions:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb42541e" class="outline-2">
<h2 id="orgb42541e">README For "Dessert Recipes":</h2>
<div class="outline-text-2" id="text-orgb42541e">
<p>
NOTE: These are recipes that I have gathered from the internet, and are mostly NOT my own.
</p>

<p>
I will indicate my own recipes with a "By: Samuel Banya" section in its title whenever 
necessary.
</p>

<p>
This being noted, I have the related links whenever possible to the original creators, so
feel free to visit those links to find out even more great food recipes.
</p>

<p>
I am including them here in one quick and accessible page for myself, but also for you to 
enjoy in plain-text format to be read on any device, courtesy of Emacs Org Mode :)
</p>
</div>
</div>
<div id="outline-container-orge6c0043" class="outline-2">
<h2 id="orge6c0043">Banana Bread Recipe</h2>
<div class="outline-text-2" id="text-orge6c0043">
</div>
<div id="outline-container-orgcb7b538" class="outline-3">
<h3 id="orgcb7b538">Link:</h3>
<div class="outline-text-3" id="text-orgcb7b538">
<ul class="org-ul">
<li><a href="https://thesaltymarshmallow.com/one-bowl-chocolate-chip-banana-bread/">https://thesaltymarshmallow.com/one-bowl-chocolate-chip-banana-bread/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4475fc2" class="outline-3">
<h3 id="org4475fc2">Ingredients:</h3>
<div class="outline-text-3" id="text-org4475fc2">
<ul class="org-ul">
<li>3 Ripe Bananas</li>
<li>1/2 Cup Butter, Melted</li>
<li>1/2 Cup Sour Cream</li>
<li>2 Large Eggs</li>
<li>1 Cup Granulated Suar</li>
<li>1 Teaspoons Vanilla Extract</li>
<li>1 Teaspoon Baking Soda</li>
<li>1 Teaspoon Salt</li>
<li>1 1/2 Cups All Purpose Flour</li>
<li>1/2 Cup Chocolate Chips</li>
</ul>
</div>
</div>
<div id="outline-container-org58942f4" class="outline-3">
<h3 id="org58942f4">Directions</h3>
<div class="outline-text-3" id="text-org58942f4">
<ol class="org-ol">
<li>Preheat oven to 350F degrees.</li>

<li>Grease a 9x5 inch loaf pan with vegetable oil, or spray with non stick cooking spray that has flour added.</li>

<li>In a large bowl mash the bananas until smooth.</li>

<li>Stir in the melted butter and sour cream.</li>

<li>Stir in the eggs, sugar, and vanilla extract.</li>
</ol>

<p>
6 . Stir in the baking soda, salt, and flour until just combined.
</p>

<ol class="org-ol">
<li>Fold in the chocolate chips.</li>

<li>Pour batter into the prepared pan.</li>

<li>Bake for 50-60 minutes, until a toothpick inserted in the center comes out clean.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org8f365f1" class="outline-2">
<h2 id="org8f365f1">Cherry Pie Recipe</h2>
<div class="outline-text-2" id="text-org8f365f1">
</div>
<div id="outline-container-org8ddab93" class="outline-3">
<h3 id="org8ddab93">Link:</h3>
<div class="outline-text-3" id="text-org8ddab93">
<ul class="org-ul">
<li><a href="https://www.seriouseats.com/recipes/2016/06/fresh-cherry-pie-filling-recipe.html">https://www.seriouseats.com/recipes/2016/06/fresh-cherry-pie-filling-recipe.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3b9a284" class="outline-3">
<h3 id="org3b9a284">Ingredients:</h3>
<div class="outline-text-3" id="text-org3b9a284">
</div>
<div id="outline-container-orgb57dd8a" class="outline-4">
<h4 id="orgb57dd8a">Filling:</h4>
<div class="outline-text-4" id="text-orgb57dd8a">
<ul class="org-ul">
<li>28 ounces pitted cherries (5 heaping cups; 790g), from about 2 pounds whole fruit (6 heaping cups; 910g) (see note)</li>
<li>1 ounce fresh lemon juice (2 tablespoons; 30g) from 1 small lemon</li>
<li>7 ounces sugar (1 cup; 195g)</li>
<li>3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight</li>
<li>1 1/2 ounces tapioca starch, such as Bob's Red Mill (1/3 cup plus 1 teaspoon; 40g)</li>
</ul>
</div>
</div>
<div id="outline-container-org6b8f89d" class="outline-4">
<h4 id="org6b8f89d">Crust</h4>
<div class="outline-text-4" id="text-org6b8f89d">
<ul class="org-ul">
<li>Old-Fashioned Flaky Pie Dough, rolled and chilled as per the directions for a double crust</li>
</ul>
</div>
</div>
<div id="outline-container-org535c024" class="outline-4">
<h4 id="org535c024">For the Egg Wash (optional):</h4>
<div class="outline-text-4" id="text-org535c024">
<ul class="org-ul">
<li>1 large egg</li>
<li>1 large egg yolk</li>
<li>1/2 ounce heavy cream (1 tablespoon; 15g)</li>
<li>1/8 teaspoon (1/2g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight</li>
</ul>
</div>
</div>
</div>
