dessertrecipes.org
** Directions:
1. Combine pitted cherries, lemon juice, sugar, salt, and tapioca starch in a large bowl, folding with a flexible spatula until well combined. 

2. Scrape into prepared pie shell and top with remaining dough, using a solid sheet, cutouts, or a lattice-top design. (Check out my tutorials here.) 

3. Trim away excess dough and refrigerate pie to ensure top crust is completely chilled, about 30 minutes. 

4. Meanwhile, adjust oven rack to lower-middle position and preheat to 400°F.

5. Whisk egg, egg yolk, cream, and salt in a small bowl. 

6. Brush over chilled top crust in a thin, even layer. This will give the crust a glossy, golden sheen, but it is not necessary in any way.

7. Place chilled pie on a parchment-lined rimmed baking sheet. 

8. Bake until crust is golden, about 1 hour, then loosely cover with tented foil. (Alternatively, an empty baking sheet can be placed on the topmost rack of the oven to serve as a shield.) 

9. Continue baking until filling is bubbling even in the very center of the pie, about 15 minutes more. 

10. If crust completely covers filling, bake until pie reaches an internal temperature of 213°F on a digital thermometer. 

11. The time can vary considerably depending on the thickness and type of pie plate, the amount of top crust, how long the pie was refrigerated, et cetera.

12. Cool pie until no warmer than 85°F on a digital thermometer, about 3 hours depending on the type of pie plate (at higher temperatures, filling will be runny and thin). 

13. Slice into wedges with a sharp knife, pressing firmly against bottom and sides of pie plate to ensure the under-crust is completely cut. 

14. If you like, serve with Cherry Pit Whipped Cream. 

15. Wrapped in foil, leftovers will keep up to 3 days at room temperature; warm 10 minutes in a 350°F oven to revive crust before serving.
* Chocolate Babka Recipe
** Link:
- https://prettysimplesweet.com/chocolate-babka/
** Ingredients:
*** Dough Ingredients:
- 3 1/4 cups (530 g/18.7oz) all-purpose flour , plus extra for dusting
- 1/2 cup (100 g/3.5oz) granulated sugar
- 1 tablespoon (10g) instant yeast
- 3 large eggs
- 1/2 cup (120 m) water
- 3/4 teaspoon fine sea salt
- 2/3 cup (150 g/5.3 oz) unsalted butter , at room temperature, cut into small cubes
- Neutral oil (sunflower, canola) for dressing
*** Chocolate Filling Ingredients:
- 1/2 cup (50 g/1.7oz) powdered sugar
- 1/3 cup (30 g/1oz) unsweetened cocoa powder
- 130 g (4 oz) dark chocolate , melted*
- 1/2 cup (120 g/4oz) unsalted butter , melted
- 2/3 cup (120 g/4oz) chocolate chips or chunks OR 1 cup (100g/3.5oz) pecans, coarsely chopped (optional)
*** Sugar Syrup Ingredients:
- 1/2 cup (120ml) water
- 1/2 cup (100g) granulated sugar
** Directions:
1. Making the dough: Place flour, sugar, and yeast in a standing mixer fitted with the dough hook and mix on low speed until combined.

2. Add eggs and water, and mix on medium speed until dough comes together, 2-3 minutes.

3. Add salt, then butter, adding a few cubes at a time, mixing until incorporated.

4. Continue mixing for about 10 minutes on medium speed, until dough is completely smooth, elastic, shiny, and pulls away from the sides of the bowl.

5. During mixing, you will need to scrape down the sides of the bowl.

6. Place dough in a large bowl brushed with oil, cover with plastic wrap, and leave in the fridge for at least half a day or overnight.

7. Grease two 2¼-lb/1kg loaf pans (9x4 inch/23x10 cm) with oil and line the bottom of each pan with parchment paper. Divide dough in half and keep one half covered in the fridge.

8. Making the filling: Whisk together powdered sugar, cocoa powder, chocolate, and butter until you have a spreadable paste.

9. Roll out dough on a lightly floured surface and shape into a rectangle measuring 15x11 inches (38x28 cm).

10. Position dough so that a long side is closest to you.

11. Using an offset spatula, spread half of the chocolate mixture over the rectangle, leaving a ¾ inch/2 cm border all around. Sprinkle half of the pecans or chocolate chips on top of the chocolate.

12. Shaping the dough (photos here): Use both hands to roll up the rectangle like a roulade, starting from the long side closest to you and ending at the other long end.

13. Press to seal the dampened end onto the roulade, then use both hands to even out the roll into a perfect thick cigar.

14. Rest the cigar on its seam.

15. Trim about ¾ inch/2 cm off both ends of the roulade with a serrated knife.

16. Then use the knife to gently cut the roll in half lengthwise, starting at the top and finishing at the seam, essentially dividing the log into two long even halves, with the layers of dough and filling visible along the length of both halves.

17. With the cut sides facing up, gently press together one end of each half, then lift the right half over the left half.

18. Repeat this process, but this time lifting the left half over the right, to create a simple two-pronged plait.

19. Gently squeeze together the other ends so that you are left with the two halves, intertwined, showing the filling on top.

20. Carefully lift the cake into a loaf pan.

21. Don’t worry if there are gaps in the pan since the cake will rise and will eventually look fine, even if you feel like it’s messy at this point.

22. Cover the pan loosely with plastic wrap or a wet tea towel and leave to rise in a warm place for 1 to 1½ hours.

23. Repeat to make the second cake.

24. Preheat oven to 375°F/190°C, making sure to allow plenty of time for it to heat fully before the cakes have finished rising.

25. Remove plastic wrap or tea towels, place cakes on middle rack of oven, and bake for about 25-30 minutes, until a skewer inserted into the center comes out clean with no dough attached.

26. While the cakes are in the oven, make the syrup.

27. In a small saucepan over medium heat, bring water and sugar to a boil.

28. As soon as the sugar dissolves, remove from heat and set aside to cool.

29. As soon as the cakes come out of the oven, brush the syrup over them.

30. Use all of the syrup, even if it looks a lot.

31. Let cakes cool until they are warm, then remove from pans and let cool completely before serving.

32. Serve warm or at room temperature.

33. Babka will stay fresh for 24 hours in an airtight container at room temperature. Don’t place in the fridge.

34. Babka freezes well for up to 2 months.

35. To thaw, leave on counter or overnight in the fridge.
* Coconut Custard Pie Recipe
** Links:
- This is the link for the actual recipe:
+ https://www.allrecipes.com/recipe/12580/coconut-custard-pie-i/
- This isn't the actual main recipe link, but this is a good backup recipe link for later use if I decide that this is a more legit recipe to use:
+ https://www.prouditaliancook.com/2018/10/vintage-coconut-custard-pie.html
