dessertrecipes.html
<div id="outline-container-orgdb6e86f" class="outline-3">
<h3 id="orgdb6e86f">Directions:</h3>
<div class="outline-text-3" id="text-orgdb6e86f">
<ol class="org-ol">
<li>Combine pitted cherries, lemon juice, sugar, salt, and tapioca starch in a large bowl, folding with a flexible spatula until well combined.</li>

<li>Scrape into prepared pie shell and top with remaining dough, using a solid sheet, cutouts, or a lattice-top design. (Check out my tutorials here.)</li>

<li>Trim away excess dough and refrigerate pie to ensure top crust is completely chilled, about 30 minutes.</li>

<li>Meanwhile, adjust oven rack to lower-middle position and preheat to 400°F.</li>

<li>Whisk egg, egg yolk, cream, and salt in a small bowl.</li>

<li>Brush over chilled top crust in a thin, even layer. This will give the crust a glossy, golden sheen, but it is not necessary in any way.</li>

<li>Place chilled pie on a parchment-lined rimmed baking sheet.</li>

<li>Bake until crust is golden, about 1 hour, then loosely cover with tented foil. (Alternatively, an empty baking sheet can be placed on the topmost rack of the oven to serve as a shield.)</li>

<li>Continue baking until filling is bubbling even in the very center of the pie, about 15 minutes more.</li>

<li>If crust completely covers filling, bake until pie reaches an internal temperature of 213°F on a digital thermometer.</li>

<li>The time can vary considerably depending on the thickness and type of pie plate, the amount of top crust, how long the pie was refrigerated, et cetera.</li>

<li>Cool pie until no warmer than 85°F on a digital thermometer, about 3 hours depending on the type of pie plate (at higher temperatures, filling will be runny and thin).</li>

<li>Slice into wedges with a sharp knife, pressing firmly against bottom and sides of pie plate to ensure the under-crust is completely cut.</li>

<li>If you like, serve with Cherry Pit Whipped Cream.</li>

<li>Wrapped in foil, leftovers will keep up to 3 days at room temperature; warm 10 minutes in a 350°F oven to revive crust before serving.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org03a5af5" class="outline-2">
<h2 id="org03a5af5">Chocolate Babka Recipe</h2>
<div class="outline-text-2" id="text-org03a5af5">
</div>
<div id="outline-container-org7f567bb" class="outline-3">
<h3 id="org7f567bb">Link:</h3>
<div class="outline-text-3" id="text-org7f567bb">
<ul class="org-ul">
<li><a href="https://prettysimplesweet.com/chocolate-babka/">https://prettysimplesweet.com/chocolate-babka/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf1353f8" class="outline-3">
<h3 id="orgf1353f8">Ingredients:</h3>
<div class="outline-text-3" id="text-orgf1353f8">
</div>
<div id="outline-container-orgaca78ec" class="outline-4">
<h4 id="orgaca78ec">Dough Ingredients:</h4>
<div class="outline-text-4" id="text-orgaca78ec">
<ul class="org-ul">
<li>3 1/4 cups (530 g/18.7oz) all-purpose flour , plus extra for dusting</li>
<li>1/2 cup (100 g/3.5oz) granulated sugar</li>
<li>1 tablespoon (10g) instant yeast</li>
<li>3 large eggs</li>
<li>1/2 cup (120 m) water</li>
<li>3/4 teaspoon fine sea salt</li>
<li>2/3 cup (150 g/5.3 oz) unsalted butter , at room temperature, cut into small cubes</li>
<li>Neutral oil (sunflower, canola) for dressing</li>
</ul>
</div>
</div>
<div id="outline-container-org3f6015a" class="outline-4">
<h4 id="org3f6015a">Chocolate Filling Ingredients:</h4>
<div class="outline-text-4" id="text-org3f6015a">
<ul class="org-ul">
<li>1/2 cup (50 g/1.7oz) powdered sugar</li>
<li>1/3 cup (30 g/1oz) unsweetened cocoa powder</li>
<li>130 g (4 oz) dark chocolate , melted*</li>
<li>1/2 cup (120 g/4oz) unsalted butter , melted</li>
<li>2/3 cup (120 g/4oz) chocolate chips or chunks OR 1 cup (100g/3.5oz) pecans, coarsely chopped (optional)</li>
</ul>
</div>
</div>
<div id="outline-container-org2110c44" class="outline-4">
<h4 id="org2110c44">Sugar Syrup Ingredients:</h4>
<div class="outline-text-4" id="text-org2110c44">
<ul class="org-ul">
<li>1/2 cup (120ml) water</li>
<li>1/2 cup (100g) granulated sugar</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf253c24" class="outline-3">
<h3 id="orgf253c24">Directions:</h3>
<div class="outline-text-3" id="text-orgf253c24">
<ol class="org-ol">
<li>Making the dough: Place flour, sugar, and yeast in a standing mixer fitted with the dough hook and mix on low speed until combined.</li>

<li>Add eggs and water, and mix on medium speed until dough comes together, 2-3 minutes.</li>

<li>Add salt, then butter, adding a few cubes at a time, mixing until incorporated.</li>

<li>Continue mixing for about 10 minutes on medium speed, until dough is completely smooth, elastic, shiny, and pulls away from the sides of the bowl.</li>

<li>During mixing, you will need to scrape down the sides of the bowl.</li>

<li>Place dough in a large bowl brushed with oil, cover with plastic wrap, and leave in the fridge for at least half a day or overnight.</li>

<li>Grease two 2¼-lb/1kg loaf pans (9x4 inch/23x10 cm) with oil and line the bottom of each pan with parchment paper. Divide dough in half and keep one half covered in the fridge.</li>

<li>Making the filling: Whisk together powdered sugar, cocoa powder, chocolate, and butter until you have a spreadable paste.</li>

<li>Roll out dough on a lightly floured surface and shape into a rectangle measuring 15x11 inches (38x28 cm).</li>

<li>Position dough so that a long side is closest to you.</li>

<li>Using an offset spatula, spread half of the chocolate mixture over the rectangle, leaving a ¾ inch/2 cm border all around. Sprinkle half of the pecans or chocolate chips on top of the chocolate.</li>

<li>Shaping the dough (photos here): Use both hands to roll up the rectangle like a roulade, starting from the long side closest to you and ending at the other long end.</li>

<li>Press to seal the dampened end onto the roulade, then use both hands to even out the roll into a perfect thick cigar.</li>

<li>Rest the cigar on its seam.</li>

<li>Trim about ¾ inch/2 cm off both ends of the roulade with a serrated knife.</li>

<li>Then use the knife to gently cut the roll in half lengthwise, starting at the top and finishing at the seam, essentially dividing the log into two long even halves, with the layers of dough and filling visible along the length of both halves.</li>

<li>With the cut sides facing up, gently press together one end of each half, then lift the right half over the left half.</li>

<li>Repeat this process, but this time lifting the left half over the right, to create a simple two-pronged plait.</li>

<li>Gently squeeze together the other ends so that you are left with the two halves, intertwined, showing the filling on top.</li>

<li>Carefully lift the cake into a loaf pan.</li>

<li>Don’t worry if there are gaps in the pan since the cake will rise and will eventually look fine, even if you feel like it’s messy at this point.</li>

<li>Cover the pan loosely with plastic wrap or a wet tea towel and leave to rise in a warm place for 1 to 1½ hours.</li>

<li>Repeat to make the second cake.</li>

<li>Preheat oven to 375°F/190°C, making sure to allow plenty of time for it to heat fully before the cakes have finished rising.</li>

<li>Remove plastic wrap or tea towels, place cakes on middle rack of oven, and bake for about 25-30 minutes, until a skewer inserted into the center comes out clean with no dough attached.</li>

<li>While the cakes are in the oven, make the syrup.</li>

<li>In a small saucepan over medium heat, bring water and sugar to a boil.</li>

<li>As soon as the sugar dissolves, remove from heat and set aside to cool.</li>

<li>As soon as the cakes come out of the oven, brush the syrup over them.</li>

<li>Use all of the syrup, even if it looks a lot.</li>

<li>Let cakes cool until they are warm, then remove from pans and let cool completely before serving.</li>

<li>Serve warm or at room temperature.</li>

<li>Babka will stay fresh for 24 hours in an airtight container at room temperature. Don’t place in the fridge.</li>

<li>Babka freezes well for up to 2 months.</li>

<li>To thaw, leave on counter or overnight in the fridge.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org0b75c3f" class="outline-2">
<h2 id="org0b75c3f">Coconut Custard Pie Recipe</h2>
<div class="outline-text-2" id="text-org0b75c3f">
</div>
<div id="outline-container-org57ebb4b" class="outline-3">
<h3 id="org57ebb4b">Links:</h3>
<div class="outline-text-3" id="text-org57ebb4b">
<ul class="org-ul">
<li>This is the link for the actual recipe:</li>
<li><a href="https://www.allrecipes.com/recipe/12580/coconut-custard-pie-i/">https://www.allrecipes.com/recipe/12580/coconut-custard-pie-i/</a></li>
<li>This isn't the actual main recipe link, but this is a good backup recipe link for later use if I decide that this is a more legit recipe to use:</li>
<li><a href="https://www.prouditaliancook.com/2018/10/vintage-coconut-custard-pie.html">https://www.prouditaliancook.com/2018/10/vintage-coconut-custard-pie.html</a></li>
</ul>
</div>
</div>
