dessertrecipes.org
** Ingredients:
- 1/2 cup butter
- 1 1/2 cups white sugar
- 2 tablespoons all-purpose flour
- 2 eggs
- 1 cup milk
- 1 cup flaked coconut
- 1 teaspoon vanilla extract
- 1 recipe pastry for a 9 inch single crust pie
- 1 tablespoon flaked coconut
** Directions:
1. Preheat oven to 350 degrees F (175 degrees C).

2. In a large bowl, beat together butter or margarine, sugar, and eggs with an electric mixer on low speed.

3. Blend in flour.

4. Mix in 1/2 cup of milk at a time.

5. Add 1 cup coconut and vanilla, and mix well.

6. Pour filling into unbaked pie shell.

7. Sprinkle top with additional coconut before baking, just enough to lightly cover the top.

8. Bake for 40 to 50 minutes, or until set.
* Diós Tészta (Hungarian Sweet Walnut Pasta) Recipe
** Link
- https://budapestcookingclass.com/hungarian-sweet-walnut-pasta-dios-teszta/
** Ingredients: (Serves 4 people)
- 500 grams (17.6 ounces) dried wide stripe or tagliatelle pasta
- 1/2 stick (4 tablespoons, 2 ounces) of butter
- 100 grams (3.6 ounces) of ground walnuts (1.7 oz --> 1/2 cup, Converted: this would be about 3.4 oz or 1 cup)
- 50 grams (1.8 ounces) of powdered sugar (1.7 oz --> 1/2 cup)
- Salt
** Directions:
1. Cook the pasta in salted water according to package instructions, rinse under cold running water, drain.

2. Mix the ground walnuts with the powdered sugar.

3. In a pot melt the butter. Pour the pasta over the melted butter and mix it all together.
 
3. Sprinkle on the sweet walnuts and serve.
* Hideg Meggyleves Recipe (Cold Cherry Soup)
** Links:
- https://budapestcookingclass.com/hungarian-chilled-sour-cherry-soup-recipe-hideg-meggyleves/
- https://www.youtube.com/watch?v=yjuDl2cBpEg
** Ingredients:
- 500 grams (17.6 ounces) of sour cherries – pitted
- 3 tablespoons of sugar
- 1 cinnamon stick
- 10-15 pieces of cloves
- 200 ml (3/4 cup) of heavy cream (20-30%)
- 1000 ml (4 cups) of water
- Juice of half a lemon
** Directions:
1. In a soup pot cook the pitted sour cherries in water with 3 tablespoons of sugar, the cloves and the cinnamon stick until cherries are cooked, it takes about 5-10 minutes.

2. Remove the pot from the heat. 

3. In a bowl, mix the heavy cream with some soup liquid and pour this mixture back into the soup pot. 

4. NOTE: You cannot add the cream directly to the hot liquid, as it will cause it to curdle. You need to temper the cream first.

5. Bring it back to a boil. 

6. When it starts boiling, turn the heat off and add the lemon juice slowly, spoon by spoon. 

7. Taste it.

8. It is a refreshing soup with a nice balance of sweet and sour. 

9. Add more sugar or lemon juice if necessary.

10. Cool the soup to room temperature in a cold water bath and refrigerate until cold.
* Hungarian Gerbeaud Cake (Zserbó Szelet)
** Link:
- https://budapestcookingclass.com/hungarian-gerbeaud-cake-recipe-zserbo-szelet/
** Ingredients:
- 500 grams (17.6 ounces) of plain flour
- 250 grams (8.8 ounces) of margarine or butter
- 25 grams (0.9 ounces) of fresh yeast
- 1 whole egg
- 2 egg yolks
- 1 tablespoon of sugar
- 100 ml (0.44 cups) of whole milk
- Zest of half a lemon
- Pinch of salt
- 150 grams (5.3 ounces) of ground walnuts
- 50 grams (1.8 ounces) of powdered sugar
- 400 grams (14.1 ounces) of homemade apricot jam
- 100 grams (1 stick) of butter
- 4 tablespoons of sugar
- 4 tablespoons of cocoa powder (20-22%)
- 4 tablespoons of water

** Directions:
1.  In a smaller pan heat milk until lukewarm and dissolve the sugar and the yeast.

2. In a large bowl mix the flour and the cubed 250g (8,8 ounces) margarine or butter by hand. 

3. The mixture will be quite crumbly.

4. Add the whole egg, 2 egg yolks, the dissolved sugar and yeast mixture, pinch of salt and the lemon zest. 

5. Knead thoroughly. 

6. Add more flour if necessary.

7. Divide the dough into 4 balls, cover and let rest for 30 minutes.

8. Heat the oven to 180°C (355°F). 

9. Butter and flour your baking tin, ex: a 16×10 inch (40x25cm) pan.

10. On a floured surface roll out one part of the dough to the size of the baking tin, then lay it in.

11. Mix the ground walnuts (150g) with the powdered sugar (50g). 

12. Spread one third of the apricot jam on the first layer of dough. 

13. Sprinkle with third of the walnut-sugar mixture.

14. Roll out the second piece of dough. 

15. Put the jam on it and sprinkle with walnut-sugar mixture.

16. Roll out the third piece of dough. 

17. Spread the jam on it and sprinkle with walnut-sugar mixture.

18. Roll out the forth layer and place on top.

19. Bake the cake for 30 minute, until the top is light-brown. 

20. Let it cool completely.

21. For the chocolate cover: in a smaller pan melt 100 grams (3,5 ounces) butter

22. Then, add 4 tablespoons of cocoa powder, 4 tablespoons of sugar and 4 tablespoons of water

22. Stir until the sugar melts and the mixture thickens. 

23. Cover your cake with the chocolate sauce. 

24. The butter will make the chocolate have a glassy elegant look. 

25. Cut into diamonds and serve.
* Ice Cream In A Blender Recipe
** Link:
- https://betterfood.co/how-to-make-ice-cream-in-ninja-blender/
** Ingredients:
- 2 1/2 cups plus 2 Tablespoons of whole milk, divided
- 1 package (3.4 ounces) vanilla instant pudding mix
- 2 teaspoons vanilla extract
- 2 standard ice cube trays
- 1 large mixing bowl
- 1 wire whisk
