dessertrecipes.html
<div id="outline-container-org80cfb52" class="outline-3">
<h3 id="org80cfb52">Ingredients:</h3>
<div class="outline-text-3" id="text-org80cfb52">
<ul class="org-ul">
<li>1/2 cup butter</li>
<li>1 1/2 cups white sugar</li>
<li>2 tablespoons all-purpose flour</li>
<li>2 eggs</li>
<li>1 cup milk</li>
<li>1 cup flaked coconut</li>
<li>1 teaspoon vanilla extract</li>
<li>1 recipe pastry for a 9 inch single crust pie</li>
<li>1 tablespoon flaked coconut</li>
</ul>
</div>
</div>
<div id="outline-container-orgd506b4f" class="outline-3">
<h3 id="orgd506b4f">Directions:</h3>
<div class="outline-text-3" id="text-orgd506b4f">
<ol class="org-ol">
<li>Preheat oven to 350 degrees F (175 degrees C).</li>

<li>In a large bowl, beat together butter or margarine, sugar, and eggs with an electric mixer on low speed.</li>

<li>Blend in flour.</li>

<li>Mix in 1/2 cup of milk at a time.</li>

<li>Add 1 cup coconut and vanilla, and mix well.</li>

<li>Pour filling into unbaked pie shell.</li>

<li>Sprinkle top with additional coconut before baking, just enough to lightly cover the top.</li>

<li>Bake for 40 to 50 minutes, or until set.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4e21dc8" class="outline-2">
<h2 id="org4e21dc8">Diós Tészta (Hungarian Sweet Walnut Pasta) Recipe</h2>
<div class="outline-text-2" id="text-org4e21dc8">
</div>
<div id="outline-container-org94403f5" class="outline-3">
<h3 id="org94403f5">Link</h3>
<div class="outline-text-3" id="text-org94403f5">
<ul class="org-ul">
<li><a href="https://budapestcookingclass.com/hungarian-sweet-walnut-pasta-dios-teszta/">https://budapestcookingclass.com/hungarian-sweet-walnut-pasta-dios-teszta/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd356a4a" class="outline-3">
<h3 id="orgd356a4a">Ingredients: (Serves 4 people)</h3>
<div class="outline-text-3" id="text-orgd356a4a">
<ul class="org-ul">
<li>500 grams (17.6 ounces) dried wide stripe or tagliatelle pasta</li>
<li>1/2 stick (4 tablespoons, 2 ounces) of butter</li>
<li>100 grams (3.6 ounces) of ground walnuts (1.7 oz &#x2013;&gt; 1/2 cup, Converted: this would be about 3.4 oz or 1 cup)</li>
<li>50 grams (1.8 ounces) of powdered sugar (1.7 oz &#x2013;&gt; 1/2 cup)</li>
<li>Salt</li>
</ul>
</div>
</div>
<div id="outline-container-org229ce1a" class="outline-3">
<h3 id="org229ce1a">Directions:</h3>
<div class="outline-text-3" id="text-org229ce1a">
<ol class="org-ol">
<li>Cook the pasta in salted water according to package instructions, rinse under cold running water, drain.</li>

<li>Mix the ground walnuts with the powdered sugar.</li>

<li>In a pot melt the butter. Pour the pasta over the melted butter and mix it all together.</li>

<li>Sprinkle on the sweet walnuts and serve.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org015636c" class="outline-2">
<h2 id="org015636c">Hideg Meggyleves Recipe (Cold Cherry Soup)</h2>
<div class="outline-text-2" id="text-org015636c">
</div>
<div id="outline-container-orgf4edb54" class="outline-3">
<h3 id="orgf4edb54">Links:</h3>
<div class="outline-text-3" id="text-orgf4edb54">
<ul class="org-ul">
<li><a href="https://budapestcookingclass.com/hungarian-chilled-sour-cherry-soup-recipe-hideg-meggyleves/">https://budapestcookingclass.com/hungarian-chilled-sour-cherry-soup-recipe-hideg-meggyleves/</a></li>
<li><a href="https://www.youtube.com/watch?v=yjuDl2cBpEg">https://www.youtube.com/watch?v=yjuDl2cBpEg</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbf1384b" class="outline-3">
<h3 id="orgbf1384b">Ingredients:</h3>
<div class="outline-text-3" id="text-orgbf1384b">
<ul class="org-ul">
<li>500 grams (17.6 ounces) of sour cherries – pitted</li>
<li>3 tablespoons of sugar</li>
<li>1 cinnamon stick</li>
<li>10-15 pieces of cloves</li>
<li>200 ml (3/4 cup) of heavy cream (20-30%)</li>
<li>1000 ml (4 cups) of water</li>
<li>Juice of half a lemon</li>
</ul>
</div>
</div>
<div id="outline-container-orgf139506" class="outline-3">
<h3 id="orgf139506">Directions:</h3>
<div class="outline-text-3" id="text-orgf139506">
<ol class="org-ol">
<li>In a soup pot cook the pitted sour cherries in water with 3 tablespoons of sugar, the cloves and the cinnamon stick until cherries are cooked, it takes about 5-10 minutes.</li>

<li>Remove the pot from the heat.</li>

<li>In a bowl, mix the heavy cream with some soup liquid and pour this mixture back into the soup pot.</li>

<li>NOTE: You cannot add the cream directly to the hot liquid, as it will cause it to curdle. You need to temper the cream first.</li>

<li>Bring it back to a boil.</li>

<li>When it starts boiling, turn the heat off and add the lemon juice slowly, spoon by spoon.</li>

<li>Taste it.</li>

<li>It is a refreshing soup with a nice balance of sweet and sour.</li>

<li>Add more sugar or lemon juice if necessary.</li>

<li>Cool the soup to room temperature in a cold water bath and refrigerate until cold.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org2a0f92f" class="outline-2">
<h2 id="org2a0f92f">Hungarian Gerbeaud Cake (Zserbó Szelet)</h2>
<div class="outline-text-2" id="text-org2a0f92f">
</div>
<div id="outline-container-org6d3ce5e" class="outline-3">
<h3 id="org6d3ce5e">Link:</h3>
<div class="outline-text-3" id="text-org6d3ce5e">
<ul class="org-ul">
<li><a href="https://budapestcookingclass.com/hungarian-gerbeaud-cake-recipe-zserbo-szelet/">https://budapestcookingclass.com/hungarian-gerbeaud-cake-recipe-zserbo-szelet/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org98c2387" class="outline-3">
<h3 id="org98c2387">Ingredients:</h3>
<div class="outline-text-3" id="text-org98c2387">
<ul class="org-ul">
<li>500 grams (17.6 ounces) of plain flour</li>
<li>250 grams (8.8 ounces) of margarine or butter</li>
<li>25 grams (0.9 ounces) of fresh yeast</li>
<li>1 whole egg</li>
<li>2 egg yolks</li>
<li>1 tablespoon of sugar</li>
<li>100 ml (0.44 cups) of whole milk</li>
<li>Zest of half a lemon</li>
<li>Pinch of salt</li>
<li>150 grams (5.3 ounces) of ground walnuts</li>
<li>50 grams (1.8 ounces) of powdered sugar</li>
<li>400 grams (14.1 ounces) of homemade apricot jam</li>
<li>100 grams (1 stick) of butter</li>
<li>4 tablespoons of sugar</li>
<li>4 tablespoons of cocoa powder (20-22%)</li>
<li>4 tablespoons of water</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd498aa" class="outline-3">
<h3 id="orgfd498aa">Directions:</h3>
<div class="outline-text-3" id="text-orgfd498aa">
<ol class="org-ol">
<li>In a smaller pan heat milk until lukewarm and dissolve the sugar and the yeast.</li>

<li>In a large bowl mix the flour and the cubed 250g (8,8 ounces) margarine or butter by hand.</li>

<li>The mixture will be quite crumbly.</li>

<li>Add the whole egg, 2 egg yolks, the dissolved sugar and yeast mixture, pinch of salt and the lemon zest.</li>

<li>Knead thoroughly.</li>

<li>Add more flour if necessary.</li>

<li>Divide the dough into 4 balls, cover and let rest for 30 minutes.</li>

<li>Heat the oven to 180°C (355°F).</li>

<li>Butter and flour your baking tin, ex: a 16×10 inch (40x25cm) pan.</li>

<li>On a floured surface roll out one part of the dough to the size of the baking tin, then lay it in.</li>

<li>Mix the ground walnuts (150g) with the powdered sugar (50g).</li>

<li>Spread one third of the apricot jam on the first layer of dough.</li>

<li>Sprinkle with third of the walnut-sugar mixture.</li>

<li>Roll out the second piece of dough.</li>

<li>Put the jam on it and sprinkle with walnut-sugar mixture.</li>

<li>Roll out the third piece of dough.</li>

<li>Spread the jam on it and sprinkle with walnut-sugar mixture.</li>

<li>Roll out the forth layer and place on top.</li>

<li>Bake the cake for 30 minute, until the top is light-brown.</li>

<li>Let it cool completely.</li>

<li>For the chocolate cover: in a smaller pan melt 100 grams (3,5 ounces) butter</li>

<li>Then, add 4 tablespoons of cocoa powder, 4 tablespoons of sugar and 4 tablespoons of water</li>

<li>Stir until the sugar melts and the mixture thickens.</li>

<li>Cover your cake with the chocolate sauce.</li>

<li>The butter will make the chocolate have a glassy elegant look.</li>

<li>Cut into diamonds and serve.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org0c3b49c" class="outline-2">
<h2 id="org0c3b49c">Ice Cream In A Blender Recipe</h2>
<div class="outline-text-2" id="text-org0c3b49c">
</div>
<div id="outline-container-orgd378e98" class="outline-3">
<h3 id="orgd378e98">Link:</h3>
<div class="outline-text-3" id="text-orgd378e98">
<ul class="org-ul">
<li><a href="https://betterfood.co/how-to-make-ice-cream-in-ninja-blender/">https://betterfood.co/how-to-make-ice-cream-in-ninja-blender/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org80f3986" class="outline-3">
<h3 id="org80f3986">Ingredients:</h3>
<div class="outline-text-3" id="text-org80f3986">
<ul class="org-ul">
<li>2 1/2 cups plus 2 Tablespoons of whole milk, divided</li>
<li>1 package (3.4 ounces) vanilla instant pudding mix</li>
<li>2 teaspoons vanilla extract</li>
<li>2 standard ice cube trays</li>
<li>1 large mixing bowl</li>
<li>1 wire whisk</li>
</ul>
</div>
</div>
