dessertrecipes.org
** Directions:
1. In your mixing bowl, combine two cups of whole milk with the package of vanilla instant pudding.

2. Lightly mix with your whisk until dissolved (~1 minute).

3. Pour the mixture equally into the ice cube trays.

4. Place the trays where they can stay perfectly flat in your freezer.

5. Freeze for at least 8 hours or overnight if you can.

6. Fit the standard blade into your Ninja blender before adding all your frozen pudding cubes.

7. Then add ½ cup plus 2 Tablespoons of cold whole milk and the 2 teaspoons vanilla extract.

8. Using the crush option on your machine, blend for 35-40 seconds.

9. Remove lid and blades.

10. Serve ice cream immediately.
* Idea For Animal Cracker Ice Cream
** Idea: 
Here's my idea:
- Fuse Ice Cream recipe with pink animal crackers
* Idea To Make Soft Serve Ice Cream
** Link:
- https://www.wikihow.com/Make-Soft-Serve-Ice-Cream
* Instant Pot Old-Fashioned Rice Pudding
** Link:
- https://www.allrecipes.com/recipe/276840/instant-pot-old-fashioned-rice-pudding/
** Ingredients:
- 3 1/3 cups whole milk
- 1/2 cup white sugar
- 1/2 cup long-grain white rice
- 2 large eggs
- 1/4 cup raisins
- 1 teaspoon vanilla extract
- 1/2 teaspoon ground cinnamon 
** Directions:
1. Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function.

2. Stir in milk and sugar.

3. Warm the mixture, stirring continuously, until sugar dissolves, 3 to 4 minutes.

4. Turn Instant Pot off.

5. Add rice.

6. Close and lock the lid.

7. Select high pressure according to manufacturer's instructions; set timer for 15 minutes.

8. Allow 10 to 15 minutes for pressure to build.

9. Release pressure using the natural-release method according to manufacturer's instructions, at least 10 minutes.

10. Beat eggs in a bowl.

11. Remove lid of the Instant Pot.

12. Scoop 1 cup of pudding mixture out of the pot; add to the beaten eggs and whisk until completely blended.

13. Pour back into the Instant Pot and add raisins, vanilla extract, and cinnamon.

14. Select Saute function.

15. Cook until mixture thickens, about 3 minutes.

16. Serve warm or chilled.
* Kifli Recipe (Hungarian Crescent Rolls)
** Links:
- https://thecakedr.com/hungarian-pastry/hungarian-kifli-crescent-rolls/
- https://www.youtube.com/watch?v=HNyPkn8po7E
- https://www.youtube.com/watch?v=sH394uz6wc0
- https://www.youtube.com/watch?v=SVxafY1D1SI
- https://www.youtube.com/watch?v=Or13tRPUvM8
- https://www.youtube.com/watch?v=fvfEV3jUumc
- https://www.youtube.com/watch?v=rAR5wRtuSok
** Ingredients:
- 500 gm all-purpose flour (approx 4 cups)
- 200 gm unsalted butter at room temp (about 2 sticks or 1 cup), cubed
- 100 gm granulated sugar (approx 1/2 cup)
- 2 eggs at room temp
- 1 package of active-dry yeast (21 gm)
- about 3/4 cup whole milk, warm
- Lekvar or jam of your choice 
** Directions:
1. Combine yeast and 1/4 cup of the warm milk and set aside for a few minutes.

2. Combine flour, sugar and butter in your stand mixer and run on low speed with your dough hook until just combined.

3. Add eggs one at a time.

4. Add yeast mixture then slowly add enough milk to bring the dough together. The dough should be tacky but not actually stick to your fingers.

5. Remove from mixing bowl, divide into two balls and allow to rise at room temp for about 30 minutes.

6. Then wrap in saran wrap and chill for a minimum of 2 hours to overnight.

7. Preheat oven to 375F and line 2 rimmed cookie sheets with parchment paper or silicone mats.

8. Remove one ball of dough from the fridge at a time.

9. Roll out into a thin circle on a well-floured surface.

10. Cut into pie slices with a teaspoon-sized dollop of jam at the wide end of each pie slice.

11. Roll up, press the edges together and shape into crescents.

12. Bake at 375F for 15-18 minutes or until golden brown on top.

13. Serve warm or store at room temp in an airtight container.
* Krémes Recipe
** Link:
- https://www.tasteatlas.com/kremes/recipe
** Ingredients:
*** For Vanilla-Infused Milk:
- 2 cups milk
- 1 vanilla bean
*** For Flaky Pastry:
- 1 1/2 cup flour + 1 tbsp
- 3/4 cup margarine
- 1 pinch salt
- 4 tbsp cold water
- 4 tsp vinegar
*** For Custard:
- 8 egg yolks
- 1/2 cup sugar
- 1/3 cup flour + 1 tbsp
- 2 packages (2 tbsp) vanilla sugar
- 3 packages (21 g) gelatine
- 1/4 cup unsalted butter
- 8 egg whites
- 1/2 cup sugar
- 1 tsp fresh lemon juice
*** For Dusting: 
- 1/4 cup powdered sugar
