dessertrecipes.html
<div id="outline-container-org9d8ccc0" class="outline-3">
<h3 id="org9d8ccc0">Directions:</h3>
<div class="outline-text-3" id="text-org9d8ccc0">
<ol class="org-ol">
<li>In your mixing bowl, combine two cups of whole milk with the package of vanilla instant pudding.</li>

<li>Lightly mix with your whisk until dissolved (~1 minute).</li>

<li>Pour the mixture equally into the ice cube trays.</li>

<li>Place the trays where they can stay perfectly flat in your freezer.</li>

<li>Freeze for at least 8 hours or overnight if you can.</li>

<li>Fit the standard blade into your Ninja blender before adding all your frozen pudding cubes.</li>

<li>Then add ½ cup plus 2 Tablespoons of cold whole milk and the 2 teaspoons vanilla extract.</li>

<li>Using the crush option on your machine, blend for 35-40 seconds.</li>

<li>Remove lid and blades.</li>

<li>Serve ice cream immediately.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge681818" class="outline-2">
<h2 id="orge681818">Idea For Animal Cracker Ice Cream</h2>
<div class="outline-text-2" id="text-orge681818">
</div>
<div id="outline-container-orgc47e3b1" class="outline-3">
<h3 id="orgc47e3b1">Idea:</h3>
<div class="outline-text-3" id="text-orgc47e3b1">
<p>
Here's my idea:
</p>
<ul class="org-ul">
<li>Fuse Ice Cream recipe with pink animal crackers</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgba619dd" class="outline-2">
<h2 id="orgba619dd">Idea To Make Soft Serve Ice Cream</h2>
<div class="outline-text-2" id="text-orgba619dd">
</div>
<div id="outline-container-org7425ba6" class="outline-3">
<h3 id="org7425ba6">Link:</h3>
<div class="outline-text-3" id="text-org7425ba6">
<ul class="org-ul">
<li><a href="https://www.wikihow.com/Make-Soft-Serve-Ice-Cream">https://www.wikihow.com/Make-Soft-Serve-Ice-Cream</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge67630d" class="outline-2">
<h2 id="orge67630d">Instant Pot Old-Fashioned Rice Pudding</h2>
<div class="outline-text-2" id="text-orge67630d">
</div>
<div id="outline-container-org27953fe" class="outline-3">
<h3 id="org27953fe">Link:</h3>
<div class="outline-text-3" id="text-org27953fe">
<ul class="org-ul">
<li><a href="https://www.allrecipes.com/recipe/276840/instant-pot-old-fashioned-rice-pudding/">https://www.allrecipes.com/recipe/276840/instant-pot-old-fashioned-rice-pudding/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0e44ffd" class="outline-3">
<h3 id="org0e44ffd">Ingredients:</h3>
<div class="outline-text-3" id="text-org0e44ffd">
<ul class="org-ul">
<li>3 1/3 cups whole milk</li>
<li>1/2 cup white sugar</li>
<li>1/2 cup long-grain white rice</li>
<li>2 large eggs</li>
<li>1/4 cup raisins</li>
<li>1 teaspoon vanilla extract</li>
<li>1/2 teaspoon ground cinnamon</li>
</ul>
</div>
</div>
<div id="outline-container-org7d22907" class="outline-3">
<h3 id="org7d22907">Directions:</h3>
<div class="outline-text-3" id="text-org7d22907">
<ol class="org-ol">
<li>Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function.</li>

<li>Stir in milk and sugar.</li>

<li>Warm the mixture, stirring continuously, until sugar dissolves, 3 to 4 minutes.</li>

<li>Turn Instant Pot off.</li>

<li>Add rice.</li>

<li>Close and lock the lid.</li>

<li>Select high pressure according to manufacturer's instructions; set timer for 15 minutes.</li>

<li>Allow 10 to 15 minutes for pressure to build.</li>

<li>Release pressure using the natural-release method according to manufacturer's instructions, at least 10 minutes.</li>

<li>Beat eggs in a bowl.</li>

<li>Remove lid of the Instant Pot.</li>

<li>Scoop 1 cup of pudding mixture out of the pot; add to the beaten eggs and whisk until completely blended.</li>

<li>Pour back into the Instant Pot and add raisins, vanilla extract, and cinnamon.</li>

<li>Select Saute function.</li>

<li>Cook until mixture thickens, about 3 minutes.</li>

<li>Serve warm or chilled.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgea55034" class="outline-2">
<h2 id="orgea55034">Kifli Recipe (Hungarian Crescent Rolls)</h2>
<div class="outline-text-2" id="text-orgea55034">
</div>
<div id="outline-container-org469dae4" class="outline-3">
<h3 id="org469dae4">Links:</h3>
<div class="outline-text-3" id="text-org469dae4">
<ul class="org-ul">
<li><a href="https://thecakedr.com/hungarian-pastry/hungarian-kifli-crescent-rolls/">https://thecakedr.com/hungarian-pastry/hungarian-kifli-crescent-rolls/</a></li>
<li><a href="https://www.youtube.com/watch?v=HNyPkn8po7E">https://www.youtube.com/watch?v=HNyPkn8po7E</a></li>
<li><a href="https://www.youtube.com/watch?v=sH394uz6wc0">https://www.youtube.com/watch?v=sH394uz6wc0</a></li>
<li><a href="https://www.youtube.com/watch?v=SVxafY1D1SI">https://www.youtube.com/watch?v=SVxafY1D1SI</a></li>
<li><a href="https://www.youtube.com/watch?v=Or13tRPUvM8">https://www.youtube.com/watch?v=Or13tRPUvM8</a></li>
<li><a href="https://www.youtube.com/watch?v=fvfEV3jUumc">https://www.youtube.com/watch?v=fvfEV3jUumc</a></li>
<li><a href="https://www.youtube.com/watch?v=rAR5wRtuSok">https://www.youtube.com/watch?v=rAR5wRtuSok</a></li>
</ul>
</div>
</div>
<div id="outline-container-org63a90a6" class="outline-3">
<h3 id="org63a90a6">Ingredients:</h3>
<div class="outline-text-3" id="text-org63a90a6">
<ul class="org-ul">
<li>500 gm all-purpose flour (approx 4 cups)</li>
<li>200 gm unsalted butter at room temp (about 2 sticks or 1 cup), cubed</li>
<li>100 gm granulated sugar (approx 1/2 cup)</li>
<li>2 eggs at room temp</li>
<li>1 package of active-dry yeast (21 gm)</li>
<li>about 3/4 cup whole milk, warm</li>
<li>Lekvar or jam of your choice</li>
</ul>
</div>
</div>
<div id="outline-container-org4bc9ef3" class="outline-3">
<h3 id="org4bc9ef3">Directions:</h3>
<div class="outline-text-3" id="text-org4bc9ef3">
<ol class="org-ol">
<li>Combine yeast and 1/4 cup of the warm milk and set aside for a few minutes.</li>

<li>Combine flour, sugar and butter in your stand mixer and run on low speed with your dough hook until just combined.</li>

<li>Add eggs one at a time.</li>

<li>Add yeast mixture then slowly add enough milk to bring the dough together. The dough should be tacky but not actually stick to your fingers.</li>

<li>Remove from mixing bowl, divide into two balls and allow to rise at room temp for about 30 minutes.</li>

<li>Then wrap in saran wrap and chill for a minimum of 2 hours to overnight.</li>

<li>Preheat oven to 375F and line 2 rimmed cookie sheets with parchment paper or silicone mats.</li>

<li>Remove one ball of dough from the fridge at a time.</li>

<li>Roll out into a thin circle on a well-floured surface.</li>

<li>Cut into pie slices with a teaspoon-sized dollop of jam at the wide end of each pie slice.</li>

<li>Roll up, press the edges together and shape into crescents.</li>

<li>Bake at 375F for 15-18 minutes or until golden brown on top.</li>

<li>Serve warm or store at room temp in an airtight container.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf0e66a1" class="outline-2">
<h2 id="orgf0e66a1">Krémes Recipe</h2>
<div class="outline-text-2" id="text-orgf0e66a1">
</div>
<div id="outline-container-org70dd9aa" class="outline-3">
<h3 id="org70dd9aa">Link:</h3>
<div class="outline-text-3" id="text-org70dd9aa">
<ul class="org-ul">
<li><a href="https://www.tasteatlas.com/kremes/recipe">https://www.tasteatlas.com/kremes/recipe</a></li>
</ul>
</div>
</div>
<div id="outline-container-org39abb82" class="outline-3">
<h3 id="org39abb82">Ingredients:</h3>
<div class="outline-text-3" id="text-org39abb82">
</div>
<div id="outline-container-org2d554e9" class="outline-4">
<h4 id="org2d554e9">For Vanilla-Infused Milk:</h4>
<div class="outline-text-4" id="text-org2d554e9">
<ul class="org-ul">
<li>2 cups milk</li>
<li>1 vanilla bean</li>
</ul>
</div>
</div>
<div id="outline-container-orge00bd32" class="outline-4">
<h4 id="orge00bd32">For Flaky Pastry:</h4>
<div class="outline-text-4" id="text-orge00bd32">
<ul class="org-ul">
<li>1 1/2 cup flour + 1 tbsp</li>
<li>3/4 cup margarine</li>
<li>1 pinch salt</li>
<li>4 tbsp cold water</li>
<li>4 tsp vinegar</li>
</ul>
</div>
</div>
<div id="outline-container-org916d7c8" class="outline-4">
<h4 id="org916d7c8">For Custard:</h4>
<div class="outline-text-4" id="text-org916d7c8">
<ul class="org-ul">
<li>8 egg yolks</li>
<li>1/2 cup sugar</li>
<li>1/3 cup flour + 1 tbsp</li>
<li>2 packages (2 tbsp) vanilla sugar</li>
<li>3 packages (21 g) gelatine</li>
<li>1/4 cup unsalted butter</li>
<li>8 egg whites</li>
<li>1/2 cup sugar</li>
<li>1 tsp fresh lemon juice</li>
</ul>
</div>
</div>
<div id="outline-container-orge7d807a" class="outline-4">
<h4 id="orge7d807a">For Dusting:</h4>
<div class="outline-text-4" id="text-orge7d807a">
<ul class="org-ul">
<li>1/4 cup powdered sugar</li>
</ul>
</div>
</div>
</div>
