dessertrecipes.org
** Directions (Makes 12 Servings):
1. Start by making the vanilla-infused milk.

2. Place the milk in a small saucepan and heat it over low to medium heat.

3. Take the vanilla bean, scrape the seeds into the milk, and toss the bean pod into the milk as well.

4. Cover the saucepan, remove it from heat, and leave for 1 hour.

5. The next step is to prepare the flaky pastry.

6. Place chilled margarine and flour into a large bowl and combine them into fine crumbs.

7. Add salt, water, and vinegar, and knead into a firm dough.

8. Flour the working surface generously and roll out the dough into a thin rectangle.

9. Divide it into 4 parts, then roll out each part and stack them on top of one another.

10. Place in a refrigerator for 20 minutes.

11. Meanwhile, preheat the oven to 400°F.

12. Cut the chilled dough in half.

13. Take the first half and roll it out very thinly - this will be the top of your krémes.

14. Now, fold the dough in half and transfer it into a 9x13-inch baking pan.

15. Unfold the dough and arrange it, so it goes halfway up the sides of a baking dish and so that it has deep folds at the bottom.

16. This is done because the dough shrinks during baking.

17. Bake for 14 to 18 minutes, until the dough turns golden, but be careful not to burn it.

18. Cut into 12 equal pieces immediately, and set them aside, making sure you arrange them as they were in the baking pan.

19. Repeat the procedure with the second half of the dough, which will make the bottom of your krémes.

20. Now, make the custard.

21. Beat the egg yolks with ½ cup sugar in a medium bowl until light and fluffy - for approximately 8 minutes.

22. Combine flour, gelatin and vanilla sugar in a separate bowl.

23. Add them to the egg yolk mixture gradually and mix until smooth.

24. Take the vanilla pods out of the vanilla-infused milk, and slowly pour the milk into the bowl with the custard mixture.

25. Transfer the custard mixture into a medium-sized saucepan and place over medium heat.

26. Stir constantly until the temperature reaches 176°F (80°C).

27. Use a cooking thermometer to determine the temperature.

28. Remove the custard from heat, add butter, and set it aside.

29. In the meantime, whip the egg whites with an electric mixer until soft peaks form.

30. Add lemon juice and sugar and continue mixing until stiff and shiny.

31. Gently fold the custard into the egg white snow.

32. Pour the custard over the bottom layer of flaky pastry and place the baking dish into the fridge.

33. When the custard begins to set, arrange the pastry squares over the top.

34. Allow the krémes to cool completely.

35. Right before serving the krémes, cut them into individual pieces and dust generously with powdered sugar.
* Mákos Nudli Recipe
** Recipe Link
- https://honestcooking.com/makos-nudli-hungarian-noodle-dish-recipe/
** Ingredients:
- 7 medium size potatoes (about 550 grams), peeled and diced
- 200-220 grams all-purpose flour
- 2 pinches of salt
- 2 tablespoons sunflower oil
- 100 grams grated poppy seed
- 40 grams powder sugar
** Directions: 
1. Place the diced potatoes in a large pot, add one pinch of salt and cover with water.

2. Cook the potatoes over medium-high heat for about 15 minutes until tender.

3. Drain the potatoes, let them cool a bit, then mash them well with no chunks left.

4. Add flour, sunflower oil and mix thoroughly.

5. Kneed the dough until smooth, adding more flour if needed.

6. The dough should be light and pliable but not sticky.

7. Working with small portions at a time, roll the dough into “ropes” on a lightly floured surface.

8. Cut the “ropes” into 3-4 cm long pieces.

9. Meanwhile mix the grated poppy seed and the powder sugar in a small bowl and set aside.

10. Boil a large pan of water.

11. Add a pinch of salt and the nudli to the boiling water in batches (important: not to over-crowd them) and gently simmer until they float on the top.

12. Use a slotted spoon to transfer to a colander.

13. Drain for a minute or two and transfer to a large serving bowl.

14. Finish with the remaining nudli.

15. Sprinkle the nudli with the sugary poppy seed.

16. Gently shake the bowl to coat the nudli everywhere.

17. Serve immediately.
* Mákos Tészta Recipe
** Link
- https://budapestcookingclass.com/hungarian-sweet-poppy-seed-pasta/
** Ingredients: (Serves 4 People)
- 500 grams (17.6 ounces) dried wide stripe or tagliatelle pasta
- 1/2 stick (4 tablespoons, 2 ounces) of butter
- 100 grams (3.6 ounces) of ground poppy seeds
- 1/2 cup powdered sugar (Recipe originally called for: 50 grams (1.8 ounces) of powdered sugar)
- Salt
** Directions:
1. Boil the pasta, drain with a colander, and place into a bowl.

2. While still warm, add the half stick of butter, and then add desired amount of Mak mixture until done.

3. Serve while still warm.

4. If reheated later, put it in the microwave for 20 to 40 seconds tops, and frequently stop the microwave as poppy seed based food tends to burn easily in the microwave.
* Magyar Szilvásgombóc Recipe (Hungarian Plum Dumplings)
** Ingredients:
- 12 sweet plums (the small Italian ones are best, we were not able to find them so we cut them in half)
- Boiled potatoes (we used 5 medium-sized yukon gold potatoes)
- All purpose flour
- 1 egg
- 4 tbsp cinnamon, divided
- 3/4 cup of unseasoned bread crumbs (we made our own from whole wheat bread)
- 2-3 tbsp sugar
** Directions:
1. While boiling the peeled potatoes, wash, pit and cut the plums in half and season with 2 tbsp of cinnamon, set aside.

2. Rice potatoes while still warm (Éva made a point of this). Beat the egg by hand and combine it with the riced potatoes.
    
3. Slowly add flour to the potato and egg mixture to make a soft dough.
    
4. Using about two tablespoons of dough, press out to about 1 cm thick in the palm of your hand (about the size of the palm of your hand).

5. Add a quarter of a plum to the centre and cover entirely with the dough, pinching the seams shut.

6. Boil water with a pinch of salt.

7. Boil plum dumpling until done (they should float to the top, just like gnocchi).
    
8. Meanwhile, in a large frying pan, toast the breadcrumbs until golden and while still warm, add the sugar and mix gently until the sugar has melted and caramelized.

9. It should not be a sopping mess.

10. Turn off the heat.

11. Add the remaining 2 tbsp cinnamon and mix well.

12. Roll each cooked dumpling in the bread crumbs and plate.
    
13. Serve warm or cold, with or without yogurt or sour cream.

14. Some people even put them in hot butter, and then cover them with mak (ground poppy seed and sugar).
