dessertrecipes.html
<div id="outline-container-orgba555c1" class="outline-3">
<h3 id="orgba555c1">Directions (Makes 12 Servings):</h3>
<div class="outline-text-3" id="text-orgba555c1">
<ol class="org-ol">
<li>Start by making the vanilla-infused milk.</li>

<li>Place the milk in a small saucepan and heat it over low to medium heat.</li>

<li>Take the vanilla bean, scrape the seeds into the milk, and toss the bean pod into the milk as well.</li>

<li>Cover the saucepan, remove it from heat, and leave for 1 hour.</li>

<li>The next step is to prepare the flaky pastry.</li>

<li>Place chilled margarine and flour into a large bowl and combine them into fine crumbs.</li>

<li>Add salt, water, and vinegar, and knead into a firm dough.</li>

<li>Flour the working surface generously and roll out the dough into a thin rectangle.</li>

<li>Divide it into 4 parts, then roll out each part and stack them on top of one another.</li>

<li>Place in a refrigerator for 20 minutes.</li>

<li>Meanwhile, preheat the oven to 400°F.</li>

<li>Cut the chilled dough in half.</li>

<li>Take the first half and roll it out very thinly - this will be the top of your krémes.</li>

<li>Now, fold the dough in half and transfer it into a 9x13-inch baking pan.</li>

<li>Unfold the dough and arrange it, so it goes halfway up the sides of a baking dish and so that it has deep folds at the bottom.</li>

<li>This is done because the dough shrinks during baking.</li>

<li>Bake for 14 to 18 minutes, until the dough turns golden, but be careful not to burn it.</li>

<li>Cut into 12 equal pieces immediately, and set them aside, making sure you arrange them as they were in the baking pan.</li>

<li>Repeat the procedure with the second half of the dough, which will make the bottom of your krémes.</li>

<li>Now, make the custard.</li>

<li>Beat the egg yolks with ½ cup sugar in a medium bowl until light and fluffy - for approximately 8 minutes.</li>

<li>Combine flour, gelatin and vanilla sugar in a separate bowl.</li>

<li>Add them to the egg yolk mixture gradually and mix until smooth.</li>

<li>Take the vanilla pods out of the vanilla-infused milk, and slowly pour the milk into the bowl with the custard mixture.</li>

<li>Transfer the custard mixture into a medium-sized saucepan and place over medium heat.</li>

<li>Stir constantly until the temperature reaches 176°F (80°C).</li>

<li>Use a cooking thermometer to determine the temperature.</li>

<li>Remove the custard from heat, add butter, and set it aside.</li>

<li>In the meantime, whip the egg whites with an electric mixer until soft peaks form.</li>

<li>Add lemon juice and sugar and continue mixing until stiff and shiny.</li>

<li>Gently fold the custard into the egg white snow.</li>

<li>Pour the custard over the bottom layer of flaky pastry and place the baking dish into the fridge.</li>

<li>When the custard begins to set, arrange the pastry squares over the top.</li>

<li>Allow the krémes to cool completely.</li>

<li>Right before serving the krémes, cut them into individual pieces and dust generously with powdered sugar.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org64250e0" class="outline-2">
<h2 id="org64250e0">Mákos Nudli Recipe</h2>
<div class="outline-text-2" id="text-org64250e0">
</div>
<div id="outline-container-orgcdb402f" class="outline-3">
<h3 id="orgcdb402f">Recipe Link</h3>
<div class="outline-text-3" id="text-orgcdb402f">
<ul class="org-ul">
<li><a href="https://honestcooking.com/makos-nudli-hungarian-noodle-dish-recipe/">https://honestcooking.com/makos-nudli-hungarian-noodle-dish-recipe/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf031c39" class="outline-3">
<h3 id="orgf031c39">Ingredients:</h3>
<div class="outline-text-3" id="text-orgf031c39">
<ul class="org-ul">
<li>7 medium size potatoes (about 550 grams), peeled and diced</li>
<li>200-220 grams all-purpose flour</li>
<li>2 pinches of salt</li>
<li>2 tablespoons sunflower oil</li>
<li>100 grams grated poppy seed</li>
<li>40 grams powder sugar</li>
</ul>
</div>
</div>
<div id="outline-container-org4d9849b" class="outline-3">
<h3 id="org4d9849b">Directions:</h3>
<div class="outline-text-3" id="text-org4d9849b">
<ol class="org-ol">
<li>Place the diced potatoes in a large pot, add one pinch of salt and cover with water.</li>

<li>Cook the potatoes over medium-high heat for about 15 minutes until tender.</li>

<li>Drain the potatoes, let them cool a bit, then mash them well with no chunks left.</li>

<li>Add flour, sunflower oil and mix thoroughly.</li>

<li>Kneed the dough until smooth, adding more flour if needed.</li>

<li>The dough should be light and pliable but not sticky.</li>

<li>Working with small portions at a time, roll the dough into “ropes” on a lightly floured surface.</li>

<li>Cut the “ropes” into 3-4 cm long pieces.</li>

<li>Meanwhile mix the grated poppy seed and the powder sugar in a small bowl and set aside.</li>

<li>Boil a large pan of water.</li>

<li>Add a pinch of salt and the nudli to the boiling water in batches (important: not to over-crowd them) and gently simmer until they float on the top.</li>

<li>Use a slotted spoon to transfer to a colander.</li>

<li>Drain for a minute or two and transfer to a large serving bowl.</li>

<li>Finish with the remaining nudli.</li>

<li>Sprinkle the nudli with the sugary poppy seed.</li>

<li>Gently shake the bowl to coat the nudli everywhere.</li>

<li>Serve immediately.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc851ff6" class="outline-2">
<h2 id="orgc851ff6">Mákos Tészta Recipe</h2>
<div class="outline-text-2" id="text-orgc851ff6">
</div>
<div id="outline-container-orga4baca0" class="outline-3">
<h3 id="orga4baca0">Link</h3>
<div class="outline-text-3" id="text-orga4baca0">
<ul class="org-ul">
<li><a href="https://budapestcookingclass.com/hungarian-sweet-poppy-seed-pasta/">https://budapestcookingclass.com/hungarian-sweet-poppy-seed-pasta/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdd4b966" class="outline-3">
<h3 id="orgdd4b966">Ingredients: (Serves 4 People)</h3>
<div class="outline-text-3" id="text-orgdd4b966">
<ul class="org-ul">
<li>500 grams (17.6 ounces) dried wide stripe or tagliatelle pasta</li>
<li>1/2 stick (4 tablespoons, 2 ounces) of butter</li>
<li>100 grams (3.6 ounces) of ground poppy seeds</li>
<li>1/2 cup powdered sugar (Recipe originally called for: 50 grams (1.8 ounces) of powdered sugar)</li>
<li>Salt</li>
</ul>
</div>
</div>
<div id="outline-container-orgd96c89c" class="outline-3">
<h3 id="orgd96c89c">Directions:</h3>
<div class="outline-text-3" id="text-orgd96c89c">
<ol class="org-ol">
<li>Boil the pasta, drain with a colander, and place into a bowl.</li>

<li>While still warm, add the half stick of butter, and then add desired amount of Mak mixture until done.</li>

<li>Serve while still warm.</li>

<li>If reheated later, put it in the microwave for 20 to 40 seconds tops, and frequently stop the microwave as poppy seed based food tends to burn easily in the microwave.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb6a7900" class="outline-2">
<h2 id="orgb6a7900">Magyar Szilvásgombóc Recipe (Hungarian Plum Dumplings)</h2>
<div class="outline-text-2" id="text-orgb6a7900">
</div>
<div id="outline-container-org632b105" class="outline-3">
<h3 id="org632b105">Ingredients:</h3>
<div class="outline-text-3" id="text-org632b105">
<ul class="org-ul">
<li>12 sweet plums (the small Italian ones are best, we were not able to find them so we cut them in half)</li>
<li>Boiled potatoes (we used 5 medium-sized yukon gold potatoes)</li>
<li>All purpose flour</li>
<li>1 egg</li>
<li>4 tbsp cinnamon, divided</li>
<li>3/4 cup of unseasoned bread crumbs (we made our own from whole wheat bread)</li>
<li>2-3 tbsp sugar</li>
</ul>
</div>
</div>
<div id="outline-container-org609bd23" class="outline-3">
<h3 id="org609bd23">Directions:</h3>
<div class="outline-text-3" id="text-org609bd23">
<ol class="org-ol">
<li>While boiling the peeled potatoes, wash, pit and cut the plums in half and season with 2 tbsp of cinnamon, set aside.</li>

<li>Rice potatoes while still warm (Éva made a point of this). Beat the egg by hand and combine it with the riced potatoes.</li>

<li>Slowly add flour to the potato and egg mixture to make a soft dough.</li>

<li>Using about two tablespoons of dough, press out to about 1 cm thick in the palm of your hand (about the size of the palm of your hand).</li>

<li>Add a quarter of a plum to the centre and cover entirely with the dough, pinching the seams shut.</li>

<li>Boil water with a pinch of salt.</li>

<li>Boil plum dumpling until done (they should float to the top, just like gnocchi).</li>

<li>Meanwhile, in a large frying pan, toast the breadcrumbs until golden and while still warm, add the sugar and mix gently until the sugar has melted and caramelized.</li>

<li>It should not be a sopping mess.</li>

<li>Turn off the heat.</li>

<li>Add the remaining 2 tbsp cinnamon and mix well.</li>

<li>Roll each cooked dumpling in the bread crumbs and plate.</li>

<li>Serve warm or cold, with or without yogurt or sour cream.</li>

<li>Some people even put them in hot butter, and then cover them with mak (ground poppy seed and sugar).</li>
</ol>
</div>
</div>
</div>
