dessertrecipes.org
* Millionaire Short Bread Cookie Recipe
** Link
- http://www.siftingfocus.com/2012/11/christmas-cookie-countdown-and-millionaires-shortbread-cookies-baking-recipe/
* Palascinta Recipe (Food Network)
** Link
- https://www.foodnetwork.com/recipes/hungarian-crepes-palacsinta-recipe-1944703
** Palascinta Ingredients:
- 3 eggs
- 1 1/4 cups all-purpose flour
- 1 cup milk
- 1 teaspoon sugar
- Pinch salt
- 1 cup carbonated water
- Butter, for cooking pancakes
** Directions:
1. Mix eggs, flour, milk, sugar and salt to make a smooth pancake dough. 

2. Let the dough rest for 1 to 2 hours.

3. Stir in the carbonated water at the last moment, just before cooking the pancakes.

4. Heat an 8-inch frying pan. 

5. When the pan is hot, add 1/4 teaspoon of the butter. 

6. Let butter melt and swirl to cover the bottom of the pan.

7. Pour a ladle of the batter into the pan and gently tip and twist the pan so that the batter covers the entire bottom of the pan. 

8. When the top of the batter bubbles, turn the pancake over and cook for 4 or 5 seconds longer. 

9. Remove the pancake. 

10. Continue until the batter is all cooked; add butter before cooking each pancake.

11. Serve by spreading raspberry jam, cocoa mix, or your favorite filling, roll up the pancake, and serve with fresh berries.
* Palascinta Recipe (By: Samuel Banya)
** Palascinta Ingredients:
- 2 cups flour
- 2 eggs
- 1 cup milk
- 1 cup soda water
- 1/2 cup vegetable oil
- 1 pinch salt
** Turos Filling Ingredients:
- 1/2 cup sugar
- 1 lb ricotta cheese
- few drops of vanilla
- few drops of lemon juice (pre-squeezed or actual lemon)
** Directions:
1. Mix palascinta ingredients in a large bowl.

2. Make sure that you mix well so that it is thin without bubbles.

3. Then, mix the turos filling together in a separate bowl, and add more sugar or lemon juice to personal preference.

4. Put some vegetable oil on your skillet or crepe pan, and heat up the pan on your stove stop (around '4' to '5' setting).

5. Pay Attention: Once the pan is hot enough, then take a ladle, and add half a ladle's worth to the pan. Let it sit there for a solid 2 seconds, and then let the mixture spread to the edges of the pan.

6. Place the pan back back on the stove top, and use a spatula to flip up JUST the edge of the crepe to check in on it.

7. Once it's semi-soft-solid after about 10 to 25 seconds (depends on your oven), then flip to the next side.

8. This is a preference thing, but you can let them be a bit more done to be more on the solid side.

9. However, some people prefer them soft, so its really up to you, try it out later on and figure out what you like (we like them on the more-done side, which are awesome when you re-heat them later in the microwave).

10. NOTE: The first palascinta is usually bad, since its pretty much a tester one to make sure the pan is working correctly, so know this ahead of time so you don't feel bad that the first one sucks.

11. Get a plate and start stacking the crepes ontop of each other as you finish cooking them.

12. When you're ready to serve them, grab a crepe and place it onto your plate.

13. Put any filling you would like onto the palascinta, including the turos filling you made.

14. NOTE: Some people like strawberry jam, nutella, chocolate or strawberry Nesquik, peanut butter etc., so have fun with it.

15. Once your filling is ontop of a palascinta, roll it up and enjoy!
* Rizskoch Recipe (Hungarian Rice Pudding Cake)
** Link:
- https://www.youtube.com/watch?v=jlPq6WiCm6k
** Ingredients (Makes 6 to 8 portions)
- 350 grams (0.8 lbs) short grain rice --> 1.4 cups
- 500 ml (about 2 cups) water
- 500 ml (about 2 cups) milk
- A pinch of salt
- 100 grams (3.5 oz) butter at room temperature (plus some for greasing the pan) --> 7 tablespoons
- 150 grams (5.3 oz) sugar --> 0.6 cups
- 1 pack (about 2 tbsp) vanilla sugar
- 4 eggs (separated)
- Zest of half of a lemon
- 1 to 2 tbsp fine breadcrumbs (for dusting the pan)
- Icing sugar
- Raspberry cordial or apricot jam
** Directions:
1. Put the washed and drained rice into a pot, pour the water over, add a pinch of salt and cover the pot. 

2. Cook on medium-low heat, (stirring sometime) until all the water has absorbed.

3. Now, pour in the milk, stir and cover the pot. 

4. Cook on very low heat (stirring now and then) until the rice is tender, and has absorbed the milk. 

5. It takes about 20-30 minutes, depending on the rice you use.

6. When it's done, remove from the heat and let it cool uncovered.

7. Meanwhile separate the eggs.

8. Add sugar, vanilla sugar and butter (at room temperature) to the egg yolks and stir well until you've got a smooth, creamy and fluffy texture. 

9. Set aside this mixture.

10. Beat the egg whites with a hand mixer until they form soft peaks.

11. Now, add the egg yolk-mixture to the cooled rice, and gently mix them together until well combined.

12. Add the egg whites and gently fold it into the rice mixture (be careful not to break the airy texture of the egg whites!).

13. Grate in the zest of half of a lemon and stir gently.

14. Grease a baking pan (I used a 30x20x5 cm) with butter then dust it with a handful of fine breadcrumbs.

15. Pour in the rice mixture and bake in the preheated oven, at 180C (360F) for 35-40 minutes

16. When the top is nice golden brown, remove the pan from the oven.

17. Cut the cake into 6 or 8 squares and serve while it's still warm.

18. Sift some icing sugar over and pour 3-4 tablespoon of raspberry cordial on top. (or serve it with good quality, homemade smooth apricot jam).
* Sour Cherry Blondies
** Link:
- https://www.thisisnotdietfood.com/sour-cherry-blindies/
** Ingredients:
- 1 cup light brown sugar, packed
- 1/2 cup butter, melted
- 1 egg
- 2 tsp vanilla
- 1/2 tsp salt
- 1 cup flour
- 1 tsp baking powder
- 1 cup pitted sour cherries
