dessertrecipes.html
<div id="outline-container-org23a0a89" class="outline-2">
<h2 id="org23a0a89">Millionaire Short Bread Cookie Recipe</h2>
<div class="outline-text-2" id="text-org23a0a89">
</div>
<div id="outline-container-org67e8c48" class="outline-3">
<h3 id="org67e8c48">Link</h3>
<div class="outline-text-3" id="text-org67e8c48">
<ul class="org-ul">
<li><a href="http://www.siftingfocus.com/2012/11/christmas-cookie-countdown-and-millionaires-shortbread-cookies-baking-recipe/">http://www.siftingfocus.com/2012/11/christmas-cookie-countdown-and-millionaires-shortbread-cookies-baking-recipe/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org63eeaf3" class="outline-2">
<h2 id="org63eeaf3">Palascinta Recipe (Food Network)</h2>
<div class="outline-text-2" id="text-org63eeaf3">
</div>
<div id="outline-container-org59d67bb" class="outline-3">
<h3 id="org59d67bb">Link</h3>
<div class="outline-text-3" id="text-org59d67bb">
<ul class="org-ul">
<li><a href="https://www.foodnetwork.com/recipes/hungarian-crepes-palacsinta-recipe-1944703">https://www.foodnetwork.com/recipes/hungarian-crepes-palacsinta-recipe-1944703</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc64348e" class="outline-3">
<h3 id="orgc64348e">Palascinta Ingredients:</h3>
<div class="outline-text-3" id="text-orgc64348e">
<ul class="org-ul">
<li>3 eggs</li>
<li>1 1/4 cups all-purpose flour</li>
<li>1 cup milk</li>
<li>1 teaspoon sugar</li>
<li>Pinch salt</li>
<li>1 cup carbonated water</li>
<li>Butter, for cooking pancakes</li>
</ul>
</div>
</div>
<div id="outline-container-org108b25d" class="outline-3">
<h3 id="org108b25d">Directions:</h3>
<div class="outline-text-3" id="text-org108b25d">
<ol class="org-ol">
<li>Mix eggs, flour, milk, sugar and salt to make a smooth pancake dough.</li>

<li>Let the dough rest for 1 to 2 hours.</li>

<li>Stir in the carbonated water at the last moment, just before cooking the pancakes.</li>

<li>Heat an 8-inch frying pan.</li>

<li>When the pan is hot, add 1/4 teaspoon of the butter.</li>

<li>Let butter melt and swirl to cover the bottom of the pan.</li>

<li>Pour a ladle of the batter into the pan and gently tip and twist the pan so that the batter covers the entire bottom of the pan.</li>

<li>When the top of the batter bubbles, turn the pancake over and cook for 4 or 5 seconds longer.</li>

<li>Remove the pancake.</li>

<li>Continue until the batter is all cooked; add butter before cooking each pancake.</li>

<li>Serve by spreading raspberry jam, cocoa mix, or your favorite filling, roll up the pancake, and serve with fresh berries.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgedf4252" class="outline-2">
<h2 id="orgedf4252">Palascinta Recipe (By: Samuel Banya)</h2>
<div class="outline-text-2" id="text-orgedf4252">
</div>
<div id="outline-container-org7039e75" class="outline-3">
<h3 id="org7039e75">Palascinta Ingredients:</h3>
<div class="outline-text-3" id="text-org7039e75">
<ul class="org-ul">
<li>2 cups flour</li>
<li>2 eggs</li>
<li>1 cup milk</li>
<li>1 cup soda water</li>
<li>1/2 cup vegetable oil</li>
<li>1 pinch salt</li>
</ul>
</div>
</div>
<div id="outline-container-orgd77788a" class="outline-3">
<h3 id="orgd77788a">Turos Filling Ingredients:</h3>
<div class="outline-text-3" id="text-orgd77788a">
<ul class="org-ul">
<li>1/2 cup sugar</li>
<li>1 lb ricotta cheese</li>
<li>few drops of vanilla</li>
<li>few drops of lemon juice (pre-squeezed or actual lemon)</li>
</ul>
</div>
</div>
<div id="outline-container-orgfef4f80" class="outline-3">
<h3 id="orgfef4f80">Directions:</h3>
<div class="outline-text-3" id="text-orgfef4f80">
<ol class="org-ol">
<li>Mix palascinta ingredients in a large bowl.</li>

<li>Make sure that you mix well so that it is thin without bubbles.</li>

<li>Then, mix the turos filling together in a separate bowl, and add more sugar or lemon juice to personal preference.</li>

<li>Put some vegetable oil on your skillet or crepe pan, and heat up the pan on your stove stop (around '4' to '5' setting).</li>

<li>Pay Attention: Once the pan is hot enough, then take a ladle, and add half a ladle's worth to the pan. Let it sit there for a solid 2 seconds, and then let the mixture spread to the edges of the pan.</li>

<li>Place the pan back back on the stove top, and use a spatula to flip up JUST the edge of the crepe to check in on it.</li>

<li>Once it's semi-soft-solid after about 10 to 25 seconds (depends on your oven), then flip to the next side.</li>

<li>This is a preference thing, but you can let them be a bit more done to be more on the solid side.</li>

<li>However, some people prefer them soft, so its really up to you, try it out later on and figure out what you like (we like them on the more-done side, which are awesome when you re-heat them later in the microwave).</li>

<li>NOTE: The first palascinta is usually bad, since its pretty much a tester one to make sure the pan is working correctly, so know this ahead of time so you don't feel bad that the first one sucks.</li>

<li>Get a plate and start stacking the crepes ontop of each other as you finish cooking them.</li>

<li>When you're ready to serve them, grab a crepe and place it onto your plate.</li>

<li>Put any filling you would like onto the palascinta, including the turos filling you made.</li>

<li>NOTE: Some people like strawberry jam, nutella, chocolate or strawberry Nesquik, peanut butter etc., so have fun with it.</li>

<li>Once your filling is ontop of a palascinta, roll it up and enjoy!</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd0c1c64" class="outline-2">
<h2 id="orgd0c1c64">Rizskoch Recipe (Hungarian Rice Pudding Cake)</h2>
<div class="outline-text-2" id="text-orgd0c1c64">
</div>
<div id="outline-container-orgfd1376b" class="outline-3">
<h3 id="orgfd1376b">Link:</h3>
<div class="outline-text-3" id="text-orgfd1376b">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=jlPq6WiCm6k">https://www.youtube.com/watch?v=jlPq6WiCm6k</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd776dd8" class="outline-3">
<h3 id="orgd776dd8">Ingredients (Makes 6 to 8 portions)</h3>
<div class="outline-text-3" id="text-orgd776dd8">
<ul class="org-ul">
<li>350 grams (0.8 lbs) short grain rice &#x2013;&gt; 1.4 cups</li>
<li>500 ml (about 2 cups) water</li>
<li>500 ml (about 2 cups) milk</li>
<li>A pinch of salt</li>
<li>100 grams (3.5 oz) butter at room temperature (plus some for greasing the pan) &#x2013;&gt; 7 tablespoons</li>
<li>150 grams (5.3 oz) sugar &#x2013;&gt; 0.6 cups</li>
<li>1 pack (about 2 tbsp) vanilla sugar</li>
<li>4 eggs (separated)</li>
<li>Zest of half of a lemon</li>
<li>1 to 2 tbsp fine breadcrumbs (for dusting the pan)</li>
<li>Icing sugar</li>
<li>Raspberry cordial or apricot jam</li>
</ul>
</div>
</div>
<div id="outline-container-orgbbf74a7" class="outline-3">
<h3 id="orgbbf74a7">Directions:</h3>
<div class="outline-text-3" id="text-orgbbf74a7">
<ol class="org-ol">
<li>Put the washed and drained rice into a pot, pour the water over, add a pinch of salt and cover the pot.</li>

<li>Cook on medium-low heat, (stirring sometime) until all the water has absorbed.</li>

<li>Now, pour in the milk, stir and cover the pot.</li>

<li>Cook on very low heat (stirring now and then) until the rice is tender, and has absorbed the milk.</li>

<li>It takes about 20-30 minutes, depending on the rice you use.</li>

<li>When it's done, remove from the heat and let it cool uncovered.</li>

<li>Meanwhile separate the eggs.</li>

<li>Add sugar, vanilla sugar and butter (at room temperature) to the egg yolks and stir well until you've got a smooth, creamy and fluffy texture.</li>

<li>Set aside this mixture.</li>

<li>Beat the egg whites with a hand mixer until they form soft peaks.</li>

<li>Now, add the egg yolk-mixture to the cooled rice, and gently mix them together until well combined.</li>

<li>Add the egg whites and gently fold it into the rice mixture (be careful not to break the airy texture of the egg whites!).</li>

<li>Grate in the zest of half of a lemon and stir gently.</li>

<li>Grease a baking pan (I used a 30x20x5 cm) with butter then dust it with a handful of fine breadcrumbs.</li>

<li>Pour in the rice mixture and bake in the preheated oven, at 180C (360F) for 35-40 minutes</li>

<li>When the top is nice golden brown, remove the pan from the oven.</li>

<li>Cut the cake into 6 or 8 squares and serve while it's still warm.</li>

<li>Sift some icing sugar over and pour 3-4 tablespoon of raspberry cordial on top. (or serve it with good quality, homemade smooth apricot jam).</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org7a01251" class="outline-2">
<h2 id="org7a01251">Sour Cherry Blondies</h2>
<div class="outline-text-2" id="text-org7a01251">
</div>
<div id="outline-container-orgfb7b242" class="outline-3">
<h3 id="orgfb7b242">Link:</h3>
<div class="outline-text-3" id="text-orgfb7b242">
<ul class="org-ul">
<li><a href="https://www.thisisnotdietfood.com/sour-cherry-blindies/">https://www.thisisnotdietfood.com/sour-cherry-blindies/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgebbe5dd" class="outline-3">
<h3 id="orgebbe5dd">Ingredients:</h3>
<div class="outline-text-3" id="text-orgebbe5dd">
<ul class="org-ul">
<li>1 cup light brown sugar, packed</li>
<li>1/2 cup butter, melted</li>
<li>1 egg</li>
<li>2 tsp vanilla</li>
<li>1/2 tsp salt</li>
<li>1 cup flour</li>
<li>1 tsp baking powder</li>
<li>1 cup pitted sour cherries</li>
</ul>
</div>
</div>
