dessertrecipes.org
** Directions:
1. Preheat oven to 350F.

2. In a medium mixing bowl combine the brown sugar, melted butter, egg, vanilla and salt.

3. Stir in the flour and baking powder.

4. Gently stir in the cherries trying not to break them apart.

5. Pour mixture into a greased 8 inch square pan and bake.

6. Bake for 28-30 minutes until toothpick inserted in center comes out clean.

7. Allow to cool before slicing and serving.
* Strawberry Ice Cream In A Blender Recipe
** Link:
- https://betterfood.co/how-to-make-ice-cream-in-ninja-blender/
** Ingredients:
- 1 1/2 cup frozen strawberries
- 1 cup heavy cream
- 1/3 cup sugar
- 1 tsp vanilla
** Directions:
1. Add all ingredients to your Ninja blender pitcher (with the blade already inside).

2. Pulse for 30 seconds or until well-blended.

3. Serve as is or freeze for 30 minutes to thicken up.

4. Would you prefer Ninja peach ice cream? No problem. Swap the frozen strawberries out for frozen peaches!
* Turos Ice Cream Recipe (By: Samuel Banya)
** Ingredients:
- 1/2 cup sugar
- 1 lb (2 cups) ricotta cheese
- 1 cup heavy cream
- 1 tsp vanilla
** Directions:
1. Add all ingredients to your blender.

2. Blend ingredients.

3. Store in freezer for 6+ hours in ice-cream container.
