dessertrecipes.html
<div id="outline-container-org1f57add" class="outline-3">
<h3 id="org1f57add">Directions:</h3>
<div class="outline-text-3" id="text-org1f57add">
<ol class="org-ol">
<li>Preheat oven to 350F.</li>

<li>In a medium mixing bowl combine the brown sugar, melted butter, egg, vanilla and salt.</li>

<li>Stir in the flour and baking powder.</li>

<li>Gently stir in the cherries trying not to break them apart.</li>

<li>Pour mixture into a greased 8 inch square pan and bake.</li>

<li>Bake for 28-30 minutes until toothpick inserted in center comes out clean.</li>

<li>Allow to cool before slicing and serving.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc67f62d" class="outline-2">
<h2 id="orgc67f62d">Strawberry Ice Cream In A Blender Recipe</h2>
<div class="outline-text-2" id="text-orgc67f62d">
</div>
<div id="outline-container-org112da85" class="outline-3">
<h3 id="org112da85">Link:</h3>
<div class="outline-text-3" id="text-org112da85">
<ul class="org-ul">
<li><a href="https://betterfood.co/how-to-make-ice-cream-in-ninja-blender/">https://betterfood.co/how-to-make-ice-cream-in-ninja-blender/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge8bf4b7" class="outline-3">
<h3 id="orge8bf4b7">Ingredients:</h3>
<div class="outline-text-3" id="text-orge8bf4b7">
<ul class="org-ul">
<li>1 1/2 cup frozen strawberries</li>
<li>1 cup heavy cream</li>
<li>1/3 cup sugar</li>
<li>1 tsp vanilla</li>
</ul>
</div>
</div>
<div id="outline-container-org5628b3a" class="outline-3">
<h3 id="org5628b3a">Directions:</h3>
<div class="outline-text-3" id="text-org5628b3a">
<ol class="org-ol">
<li>Add all ingredients to your Ninja blender pitcher (with the blade already inside).</li>

<li>Pulse for 30 seconds or until well-blended.</li>

<li>Serve as is or freeze for 30 minutes to thicken up.</li>

<li>Would you prefer Ninja peach ice cream? No problem. Swap the frozen strawberries out for frozen peaches!</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4c54548" class="outline-2">
<h2 id="org4c54548">Turos Ice Cream Recipe (By: Samuel Banya)</h2>
<div class="outline-text-2" id="text-org4c54548">
</div>
<div id="outline-container-org5140e64" class="outline-3">
<h3 id="org5140e64">Ingredients:</h3>
<div class="outline-text-3" id="text-org5140e64">
<ul class="org-ul">
<li>1/2 cup sugar</li>
<li>1 lb (2 cups) ricotta cheese</li>
<li>1 cup heavy cream</li>
<li>1 tsp vanilla</li>
</ul>
</div>
</div>
<div id="outline-container-org9a08a30" class="outline-3">
<h3 id="org9a08a30">Directions:</h3>
<div class="outline-text-3" id="text-org9a08a30">
<ol class="org-ol">
<li>Add all ingredients to your blender.</li>

<li>Blend ingredients.</li>

<li>Store in freezer for 6+ hours in ice-cream container.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Samuel Banya</p>
<p class="date">Created: 2022-04-30 Sat 22:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
